Repository: pdv-software/emoncms
Catalog: Modules/process/locale/*/LC_MESSAGES/messages.po
Languages: de_de

source: Process API
de_de: Verarbeitung API

source: Apikey authentication
de_de: Apikey Authentifikation

source: If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:
de_de: Wenn man nachfolgende Aktionen ohne Anmeldung aufrufen will, muss der Apikey zur URL hinzugefügt werden:

source: Append on the URL of your request: &apikey=APIKEY
de_de: beim Request der URL hinzufügen: &apjkey=APIKEY

source: Use POST parameter: "apikey=APIKEY"
de_de: POST Parameter benutzen: "apikey=APIKEY"

source: Add the HTTP header: "Authorization: Bearer APIKEY"
de_de: Hinzufügen zum HTTP Header: "Authorization: Bearer APIKEY"

source: Read only:
de_de: Nur Lesen:

source: Read & Write:
de_de: Lesen & Schreiben:

source: Available HTML URLs
de_de: Verfügbare HTML URLs

source: This page
de_de: Diese Seite

source: Available JSON commands
de_de: Verfügbare JSON Befehle

source: To use the json api the request url needs to include <b>.json</b>
de_de: Um die json api zu nutzen benötigt die Request-URL den Inhalt <b>.json</b>

source: Process actions
de_de: Prozess Aktionen

source: List all supported process
de_de: Prozessaktionen auflisten

source: process list setup
de_de: Prozessliste

source: Processes are executed sequentially with the result value being passed down for further processing to the next processor on this processing list.
de_de: Prozesse werden nacheinander ausgeführt. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: You have no processes defined
de_de: Es ist kein Prozess definiert

source: Order
de_de: Reihenfolge

source: Process
de_de: Verarbeitung

source: Actions
de_de: Aktionen

source: Add process
de_de: Neuer Prozess

source: Edit process
de_de: Prozess Bearbeiten

source: Value
de_de: Wert

source: Type value...
de_de: Wert ...

source: Type text...
de_de: Text ...

source: Realtime
de_de: Echtzeit

source: Daily
de_de: Täglich

source: Histogram
de_de: Histogramm

source: PHPFIWA Fixed Interval With Averaging
de_de: PHPFIWA Fixes Intervall mit Durchschnitt

source: PHPFINA Fixed Interval No Averaging
de_de: PHPFINA Fixes Intervall ohne Durchschnitt

source: PHPTIMESERIES Variable Interval No Averaging
de_de: PHPTimeSeries Variables Intervall ohne Durchschnitt

source: MYSQL TimeSeries
de_de: SQL-Tabelle TimeSeries

source: MYSQL Memory (RAM data lost on power off)
de_de: SQL Memory-Tabelle (Datenverlust bei Neustart)

source: Select interval
de_de: Auswahl Intervall

source: d
de_de: T

source: Add
de_de: Hinzufügen

source: Edit
de_de: Bearbeiten

source: Cancel
de_de: Abbrechen

source: Close
de_de: Abbrechen

source: Not modified
de_de: Nicht geändert

source: Changed, press to save
de_de: Speichern (geändert)

source: Delete
de_de: Löschen

source: ERROR
de_de: FEHLER

source: Move down
de_de: Nach Unten

source: Move up
de_de: Nach Oben

source: Saved
de_de: Gespeichert

source: UNSUPPORTED
de_de: NICHT UNTERSTÜTZT

source: Log to feed
de_de: In Feed speichern

source: <p><b>Log to feed:</b> This processor logs to a timeseries feed which can then be used to explore historic data. This is recommended for logging power, temperature, humidity, voltage and current data.</p><p><b>Feed engine:</b><ul><li><b>PHPFina</b> is the recommended feed engine it is a basic fixed interval timeseries engine.</li><li><b>PHPTimeseries</b> is for data posted at a non regular interval such as on state change.</li></ul></p><p><b>Feed interval:</b> When selecting the feed interval select an interval that is the same as, or longer than the update rate that is set in your monitoring equipment. Setting the interval rate to be shorter than the update rate of the equipment causes un-needed disk space to be used up.</p>
de_de: <p><b>In Feed Speichern:</b> Dieser Prozessor speichert Input Werte in einen Feed. Die Werte können über die Zeit ausgewertet werden. Dies wird empfohlen um Daten wie Leistung, Temperatur, Luftfeuchte, Spannung und Strom aufzuzeichnen.</p><p><b>Engine:</b><ul><li><b>PhpFixNoAvg</b> festes Intervall keine Mittelwerte</li><li><b>PhpFixWithAvg</b> festes Intervall mit Mittelwert</li><li><b>PhpTimeSeries</b> unregelmäßige Daten</li><li><SQL TimeSeries</b>unregelmäßige Daten in Tabelle</li><li><SQL Memory</b>unregelmäßige Daten im RAM (Temporäre Tabelle, Daten gehen bei Neustart verloren!)</li></ul></p><p><b>Intervall:</b> Verwenden Sie ein Intervall das größer oder gleich der Änderungsrate entspricht. Ein Intervall das zu klein gewählt ist verschwendet Speicherplatz.</p>

source: value
de_de: Wert

source: Scale current value by given value. This can be useful for calibrating a particular variable on the web rather than by reprogramming hardware. Result is passed back for further processing by the next processor in the processing list
de_de: Skaliert aktuellen Wert mit übergebenen Wert. Dies kann zur Kalibrierung von eingehenden Werten genutzt werden.

source: Offset current value by given value. This can again be useful for calibrating a particular variable on the web rather than by reprogramming hardware. Result is passed back for further processing by the next processor in the processing list
de_de: Offset um gegebenen Wert. Dies kann zur Kalibrierung von eingehenden Werten genutzt werden.

source: Power to kWh
de_de: Leistung zu kW/h

source: <p><b>Power to kWh:</b> Convert a power value in Watts to a cumulative kWh feed.<br><br><b>Visualisation tip:</b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1.<br>See forum thread here for an example <a href='https://openenergymonitor.org/emon/node/12308'>Creating kWh per day bar graphs from Accumulating kWh </a></p>
de_de: <p><b>Power zu kWh:</b> Konvertiert Power Wert in Watt zu aufsummierten kWh Wert.<br><br><b>Visualisierung Tipp:</b> Feeds mit diesem Processor können für Tägliche kWh Daten in einem Balkendiagramm mit Delta Eigenschaft =1.<br>Siehe Forum Eintrag <a href='https://openenergymonitor.org/emon/node/12308'>Creating kWh per day bar graphs from Accumulating kWh </a></p>

source: Power to kWh/d
de_de: Leistung zu kW/h Tag

source: Convert a power value in Watts to a feed that contains an entry for the total energy used each day (kWh/d)
de_de: Konvertiert Power in W in einen Wert kWh/Tag

source: Multiplies the current value with the last value from other input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.
de_de: Multipliziert aktuellen Wert mit dem letzten Wert des gewählten Inputs. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: Input on-time
de_de: Input zum Zeitpunkt

source: Counts the amount of time that an input is high in each day and logs the result to a feed. Created for counting the number of hours a solar hot water pump is on each day
de_de: Berechnet die Zeitspanne/Tag in der ein Input Werte liefert. Wird z.B. verwendet um die Betriebsstunden einer Solarpumpe zu berechnen.

source: Wh increments to kWh/d
de_de: Watt Schritte zu kW/h pro Tag

source: Accumulate Wh measurements into kWh/d.<p><b>Input</b>: energy increments in Wh.</p><p><b>Output</b>: original value is passed through untouched.</p>
de_de: Berechnet Wh in kWh/Tag.

source: kWh to kWh/d (OLD)
de_de: kW/h zu kW/h pro Tag (ALT)

source: Upsert feed at day
de_de: Upsert Feed tägl.

source: Updates or inserts daily value on the specified time (given by the JSON time parameter from the API) of the specified feed
de_de: Ändert oder Erstellt Tages-Wert beim festgelegten Feed (Zeit ist vorgegeben durch JSON time-Parameter der API)

source: Adds the current value with the last value from other input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.
de_de: Addiert des aktuellen Wert mit dem letzten Wert des gewählten Inputs. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: Divides the current value with the last value from other input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.
de_de: Dividiert den aktuellen Wert mit dem letzten Wert des gewählten Inputs. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: Phaseshift
de_de: Phasenverschiebung

source: Accumulator
de_de: Akkumulator

source: Output feed accumulates by input value
de_de: Addiert Feed mit dem Input-Wert.

source: Rate of change
de_de: Änderungsrate

source: Output feed is the difference between the current value and the last
de_de: Gibt die Differenz zwischen aktuellem Wert und letzten Wert zurück.

source: Creates a histogram of energy binned by power ranges. For each power range on the x-axis, this processor will aggregate the total energy of the stream while it was in that power range.<p><b>Input</b>: power in Watts.</p><p><b>Output</b>: original value is passed through untouched.</p>
de_de: Erstellt Histogramm für Energiedaten. energy binned by power ranges. For each power range on the x-axis, this processor will aggregate the total energy of the stream while it was in that power range.<p><b>Input</b>: power in Watts.</p><p><b>Output</b>: original value is passed through untouched.</p>

source: Daily Average
de_de: Tagesdurchschnitt

source: Heat flux
de_de: Wärmefluss

source: Power gained to kWh/d
de_de: Leistung gewonnen zu kW/h pro Tag

source: Total pulse count to pulse increment
de_de: Gesamtimpulse zu Impulszuwachs

source: kWh to Power
de_de: kW/h zu Leistung

source: Convert accumulating kWh to instantaneous power
de_de: Konvertiert aufsummierte kWh in Leistung.

source: Subtracts from the current value the last value from other input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.
de_de: Subtrahiert den aktuellen Wert vom letzten Wert des gewählten Inputs. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: kWh to kWh/d
de_de: kW/h zu kW/h pro Tag

source: Subtracts the current value with the last value from other input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.
de_de: Subtrahiert den aktuellen Wert vom letzten Wert des ausgewählten Input. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: Allow positive
de_de: Erlaube positive

source: Negative values are zeroed for further processing by the next processor in the processing list
de_de: Negative Werte werden auf 0 gesetzt. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: Allow negative
de_de: Erlaube negative

source: Positive values are zeroed for further processing by the next processor in the processing list
de_de: Positive Werte werden auf 0 gesetzt. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: Signed to unsigned
de_de: Vorzeichen zu Vorzeichenlos

source: Convert a number that was interpreted as a 16 bit signed number to an unsigned number.
de_de: Konvertiert eine 16 Bit Zahl mit Vorzeichen zu Vorzeichenlos. (signed to unsigned)

source: Max daily value
de_de: Max. Tageswert

source: Maximal daily value. Upserts on the selected daily feed the highest value reached each day
de_de: Maximaler Tageswert. Ändert am gewählten tägl. Feed das Maximum.

source: Min daily value
de_de: Min. Tageswert

source: Minimal daily value. Upserts on the selected daily feed the lowest value reached each day
de_de: Minimaler Tageswert. Ändert am gewählten tägl. Feed das Minimum.

source: Adds the current value with the last value from a feed as selected from the feed list. The result is passed back for further processing by the next processor in the processing list.
de_de: Addiert den aktuellen Wert mit dem letzten Wert des ausgewählten Feed. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: Subtracts from the current value the last value from a feed as selected from the feed list. The result is passed back for further processing by the next processor in the processing list.
de_de: Subtrahiert vom aktuellen Wert den letzten Wert des ausgewählten Feed. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: Multiplies the current value with the last value from a feed as selected from the feed list. The result is passed back for further processing by the next processor in the processing list.
de_de: Multipliziert den aktuellen Wert mit dem letzten Wert des ausgewählten Feed. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: Divides the current value by the last value from a feed as selected from the feed list. The result is passed back for further processing by the next processor in the processing list.
de_de: Dividiert den aktuellen Wert durch den letzten Wert des ausgewählten Feed. Das Resultat wird zur weiteren Verarbeitung an den nächsten Prozess in der Verarbeitungsliste weitergegeben.

source: Reset to ZERO
de_de: Zurücksetzen auf Null

source: The value '0' is passed back for further processing by the next processor in the processing list.
de_de: Der Wert 0 wird an den nächsten Prozess in der Verarbeitungsliste weitergegeben zur weiteren Verarbeitung.

source: Wh Accumulator
de_de: Wattstunden Akkumulator

source: <b>Wh Accumulator:</b> Use with emontx, emonth or emonpi pulsecount or an emontx running firmware <i>emonTxV3_4_continuous_kwhtotals</i> sending cumulative watt hours.<br><br>This processor ensures that when the emontx is reset the watt hour count in emoncms does not reset, it also checks filter's out spikes in energy use that are larger than a max power threshold set in the processor, assuming these are error's, the max power threshold is set to 25kW. <br><br><b>Visualisation tip:</b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1 and scale set to 0.001.<br>See forum thread here for an example <a href='https://openenergymonitor.org/emon/node/12308'>Creating kWh per day bar graphs from Accumulating kWh </a></p><p><b>Requires redis installed to work</b></p>
de_de: <p><b>Power zu kWh:</b> Konvertiert Leistung in Watt zu aufsummierten kWh Wert.<br><br><b>Visualisierung Tipp:</b> Feeds mit diesem Processor können für Tägliche kWh Daten in einem Balkendiagramm mit Delta Eigenschaft =1 angezeigt werden.<br>Siehe Forum Eintrag <a href='https://openenergymonitor.org/emon/node/12308'>Creating kWh per day bar graphs from Accumulating kWh </a></p>

source: Publish to MQTT
de_de: Veröffentlichen an MQTT

source: Enter MQTT topic e.g. home/power/kitchen
de_de: Eingabe MQTT Topic z.B. home/power/kitchen

source: Reset to NULL
de_de: Reset auf NULL

source: A NULL value is passed back for further processing by the next processor in the processing list.<br>Usefull for conditional process to work on.
de_de: Ein NULL Wert wird an den nächsten Prozessschritt gegeben.<br>Nützlich bei der Verwendung von Bedingungen.

source: Reset to Original
de_de: Reset auf Original

source: The original value, unchanged by any process, is passed back for further processing by the next processor in the processing list.
de_de: Original Wert wird als Resultat zur weiteren Verarbeitung weitergegeben an den nächsten Prozess in der Verarbeitungsliste.

source: If ZERO, skip next
de_de: Wenn ZERO, überspinge nächste Aktion

source: If value from last process is ZERO, process execution will skip execution of next process in list
de_de: Wenn Wert des letzten Schritts 0-ZERO, wird der nächste Schritt übersprungen.

source: If !ZERO, skip next
de_de: Wenn !ZERO, überspinge nächste Aktion

source: If value from last process is NOT ZERO, process execution will skip execution of next process in list
de_de: Wenn Wert des letzten Schritts NICHT 0-ZERO, wird der nächste Schritt übersprungen.

source: If NULL, skip next
de_de: Wenn NULL, überspinge nächste Aktion

source: If value from last process is NULL, process execution will skip execution of next process in list
de_de: Wenn Wert des letzten Schritts NULL, wird der nächste Schritt übersprungen.

source: If !NULL, skip next
de_de: Wenn !NULL, überspinge nächste Aktion

source: If value from last process is NOT NULL, process execution will skip execution of next process in list
de_de: Wenn Wert des letzten Schritts NICHT NULL, wird der nächste Schritt übersprungen.

source: If >, skip next
de_de: Wenn >, überspinge nächste Aktion

source: If >=, skip next
de_de: Wenn >=, überspinge nächste Aktion

source: If value from last process is greater or equal to the specified value, process execution will skip execution of next process in list
de_de: Wenn Wert des letzten Schritts >= Eingabewert, wird der nächste Schritt übersprungen.

source: If <, skip next
de_de: Wenn <, überspinge nächste Aktion

source: If value from last process is lower than the specified value, process execution will skip execution of next process in list
de_de: Wenn Wert des letzten Schritts < Eingabewert, wird der nächste Schritt übersprungen.

source: If <=, skip next
de_de: Wenn <=, überspinge nächste Aktion

source: If value from last process is lower or equal to the specified value, process execution will skip execution of next process in list
de_de: Wenn Wert des letzten Schritts <= Eingabewert, wird der nächste Schritt übersprungen.

source: If =, skip next
de_de: Wenn =, überspinge nächste Aktion

source: If value from last process is equal to the specified value, process execution will skip execution of next process in list
de_de: Wenn Wert des letzten Schritts = Eingabewert, wird der nächste Schritt übersprungen.

source: If !=, skip next
de_de: Wenn !=, überspinge nächste Aktion

source: If value from last process is NOT equal to the specified value, process execution will skip execution of next process in list
de_de: Wenn Wert des letzten Schritts != Eingabewert, wird der nächste Schritt übersprungen.

source: <p>Jumps the process execution to the specified position.</p><p><b>Warning</b><br>If you're not careful you can create a goto loop on the process list.<br>When a loop occurs, the API will appear to lock until the server php times out with an error.</p>
de_de: <p>Springt in der Verarbeitung zu einer festgelegten Position.</p><p><b>Warnung:</b><br>Es kann dadurch eine Endlosschleife entstehen. Wenn dies geschieht blockiert die Schleife die API bis der Server einen PHP Timeout Fehler wirft.</p>

source: Source Feed
de_de: Quell Feed

source: <p><b>Source Feed:</b><br>Virtual feeds should use this processor as the first one in the process list. It sources data from the selected feed.<br>The sourced value is passed back for further processing by the next processor in the processing list.<br>You can then add other processors to apply logic on the passed value for post-processing calculations in realtime.</p><p>Note: This virtual feed process list is executed on visualizations requests that use this virtual feed.</p>
de_de: <p><b>Quell Feed:</b><br>Virtuelle Feeds sollten diesen Schritt als ersten verwenden. Es werden die Daten des Quell-Feeds verwendet.<br>Der Quellwert wird an den nächsten Schritt weiter gegeben.<br>Es können weitere Berechnungen eingefügt werden.</p><p>Hinweis: Die Berechnungen des virtuellen Feeds werden bei der Visualisierung in Echtzeit ausgeführt. Daher kann es bei größeren Zeitbereichen zu Verzögerungen kommen.</p>

source: + source feed
de_de: + Quell Feed

source: add value to source feed
de_de: Addiert Wert zu Quell Feed

source: - source feed
de_de: - Quell Feed

source: subtract value from source feed
de_de: Subtrahiert den Wert vom Quell-Feed.

source: * source feed
de_de: * Quell Feed

source: muliply value with source feed
de_de: Multipliziert den Wert mit Quell-Feed.

source: / source feed
de_de: / Quell Feed

source: divide value by source feed
de_de: Dividiert Wert durch Quell Feed

source: 1/ source feed
de_de: 1/Quell Feed

source: calc source feed reciprocal
de_de: Berechnet Reziproken vom Quell-Feed
