Repository: pdv-software/emoncms
Catalog: Modules/schedule/locale/*/LC_MESSAGES/messages.po
Languages: de_de

source: Schedule API
de_de: Scheduler API

source: Apikey authentication
de_de: API Key Authorisation

source: If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:
de_de: Sollen Aktionen ausgeführt werden ohne angemeldet zu sein, muss der API Key hinzugefügt werden:

source: Append on the URL of your request: &apikey=APIKEY
de_de: Der URL hinzufügen: &apikey=APIKEY

source: Use POST parameter: "apikey=APIKEY"
de_de: POST Parameter: "apikey=APIKEY"

source: Add the HTTP header: "Authorization: Bearer APIKEY"
de_de: HTTP Header hinzufügen: "Authorization: Bearer APIKEY"

source: Read only:
de_de: Lesen:

source: Read & Write:
de_de: Lesen & Schreiben:

source: Available HTML URLs
de_de: Verfügbare HTML URLs

source: The schedule list view
de_de: Liste der Scheduler

source: This page
de_de: Diese Seite

source: Available JSON commands
de_de: Verfügbare JSON Befehle

source: To use the json api the request url needs to include <b>.json</b>
de_de: Für die JSON Api muss die URL <b>.json</b> enthalten

source: Schedule process actions
de_de: Scheduler Process Aktionen

source: List schedules
de_de: Scheduler Anzeigen

source: Get schedule details
de_de: Scheduler Details

source: Get only the expression
de_de: Nur Expression

source: Add a schedule
de_de: Scheduler hinzufügen

source: Delete schedule
de_de: Scheduler löschen

source: Update schedule
de_de: Scheduler aktualisieren

source: Test the expression
de_de: Expression testen

source: Expression documentation
de_de: Expression Dokumentation

source: Expression is used to specify active range.
de_de: Expression wird verwendet um den aktiven Bereich festzulegen

source: Granularity is day light saving time, month, day, week day, hour and minute.
de_de: Auflösungsgrad Sommer-/Winterzeit, Monat, Tag, Wochentag, Stunde, Minute

source: Expression is built mixing basic blocks with operation characters. An hour is always required. All other basic blocks are optional and can be mixed on the same expression to build complex schedule rules. Ranges must be ordered older-newer. White spaces are ignored and can be ommited.
de_de: Eine Expression wird verwendet um Standard Blöcke mit den Spezialzeichen zu mischen. Eine Stunde wird immer benötigt. Alle anderen Standard Blöcke sind optional und können in der gleichen Expression genutzt werden um komplexe Scheduler Regeln zu definieren. Die Regeln müssen von Alt nach Neu sortiert sein. White Spaces werden ignoriert.

source: Timezone of expression is the same of the user account that created or edited it. If the expression is public, timezones conversions are automatic taken in account between owner and user.
de_de: Als Zeitzone wird für die Expression die gleiche genutzt wie vom Benutzer der erstellt / geändert hat. Bei öffentlichen Expressions, wird die Zeitzone automatisch zwischen Ersteller und jeweiligem Benutzer konvertiert.

source: Basic blocks:
de_de: Standard Blöcke

source: Operation characters:
de_de: Spezialzeichen

source: Expression examples:
de_de: Expression Beispiele:

source: Schedule Help
de_de: Scheduler Hilfe

source: Schedules
de_de: Scheduler

source: No schedules
de_de: Keine Scheduler

source: There are no public schedules and you have not created your own yet. Please add a new schedule.<br><br>For help and examples on how to configure a schedule, read the <a href="api#expression">Expression documentation</a>.
de_de: Es gibt derzeit keine öffentlichen Scheduler und auch keine privaten Scheduler. Bitte erstellen Sie einen neuen Scheduler<br><br>Für weitere Hilfe und Beispiele wie Scheduler konfiguriert werden, lesen Sie die <a href="api#expression">Expression Dokumentation</a>.

source: New schedule
de_de: Neuer Scheduler

source: Deleting a schedule is permanent.
de_de: Schedule löschen ist dauerhaft.

source: If you have an Input or Feed Processlist that use this schedule, after deleting it, review that process list or it will be in error freezing other process lists.
de_de: Wenn ein Input oder eine Feed Process-Liste diesen Scheduler verwendet, prüfen Sie die Process-Liste. Es kann sonst auch bei anderen Process Listen zu Fehlern kommen.

source: Are you sure you want to delete?
de_de: Wirklich löschen?

source: Cancel
de_de: Abbrechen

source: Delete permanently
de_de: Dauerhaft löschen

source: Public
de_de: Öffentlich

source: Schedule
de_de: Scheduler

source: If !schedule, ZERO
de_de: IF !Scheduler, ZERO

source: If !schedule, NULL
de_de: IF !Scheduler, NULL

source: If schedule, ZERO
de_de: IF Scheduler, ZERO

source: If schedule, NULL
de_de: IF Scheduler, NULL
