Repository: pdv-software/emoncms
Catalog: Modules/feed/locale/*/LC_MESSAGES/messages.po
Languages: de_de

source: Apikey authentication
de_de: Apikey Authentifikation

source: If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:
de_de: Wenn die folgenden Funktionen ohne Anmeldung aufrufen werden sollen, kann der API Key der URL hinzugefügt werden: &apikey=APIKEY:

source: Append on the URL of your request: &apikey=APIKEY
de_de: Der URL bei Request hinzufügen: &apikey=APIKEY

source: Use POST parameter: "apikey=APIKEY"
de_de: POST Parameter: "apikey=APIKEY"

source: Add the HTTP header: "Authorization: Bearer APIKEY"
de_de: Dem HTTP Header hinzufügen: "Authorization: Bearer APIKEY"

source: Read only:
de_de: Nur Lesen:

source: Read & Write:
de_de: Lesen & Schreiben:

source: The feed list view
de_de: Listenansicht der Feeds

source: This page
de_de: Diese Seite

source: To use the json api the request url needs to include .json
de_de: Um die json Api zu nutzen muss der Request include.json enthalten

source: Read feed actions
de_de: Lese Feed Aktionen

source: List feeds for autenticated user
de_de: Liste der Feeds für Benutzer

source: List public feeds for the given user
de_de: Öffentliche Feeds des Benutzers

source: Get feed field
de_de: Feed Feld abrufen

source: Get all feed fields
de_de: Abruf Feed Felder

source: Read feed data actions
de_de: Lese Feed Daten Aktionen

source: Last updated time and value for feed
de_de: Feed aktualisiert (Wert und Zeitpunkt)

source: Last value of a given feed
de_de: Aktueller Wert des Feeds

source: Last value for multiple feeds
de_de: Letzter Wert für Multiple Feeds

source: Returns feed data
de_de: zeigt Feed Daten

source: Returns histogram data
de_de: zeigt Histogramm Daten

source: Returns kwh consumed in a given power band using histogram data type
de_de: Zeigt verbrauchte kWh in bestimmten Leistungsbereich als Histogramm Daten

source: Write feed data actions
de_de: Schreibe Feed Daten Aktionen

source: Insert new data point
de_de: Datenpunkt einfügen

source: Update data point
de_de: Datenpunkt ändern

source: Delete data point
de_de: Datenpunkt löschen

source: Feed setup actions
de_de: Feed Setup Aktionen

source: Create new feed
de_de: Feed erstellen

source: Delete existent feed
de_de: Feed Löschen

source: Update feed field
de_de: Feed Feld ändern

source: Return total engines size
de_de: Rückgabe Engine - Größe

source: Return buffer points pending write
de_de: Rückgabe Pufferpunkte für ausstehenden Schreibvorgang

source: Virtual feed process actions
de_de: Virtueller Feed Process Aktionen

source: Get feed process list
de_de: Abruf Feed Process Liste

source: Set feed process list
de_de: Setzen Feed Process LIste

source: Reset feed process list
de_de: Rücksetzen der Feed Process Liste

source: Feed API Help
de_de: Feed API Hilfe

source: No feeds created
de_de: Keine Feeds angelegt

source: Feeds are where your monitoring data is stored. The route for creating storage feeds is to start by creating inputs (see the inputs tab). Once you have inputs you can either log them straight to feeds or if you want you can add various levels of input processing to your inputs to create things like daily average data or to calibrate inputs before storage. Alternatively you can create Virtual feeds, this is a special feed that allows you to do post processing on existing storage feeds data, the main advantage is that it will not use additional storage space and you may modify post processing list that gets applyed on old stored data. You may want the next link as a guide for generating your request:
de_de: In den Feeds werden die Monitoringdaten gespeichert. Der empfohlene Weg um Feeds anzulegen ist das vorherige Anlegen von Inputs (siehe Inputs Tab). Wenn Inputs vorhanden sind können sie gespeichert werden. Alternativ können virtuelle Feeds angelegt werden, für eine Nachverarbeitung von bestehenden Feeds. Ein Vorteil besteht darin das kein zusätzlicher Speicherplatz benötigt wird und auch bestehende Daten nachverarbeitet werden können. Der folgende Link kann zur Erstellung eines Requests genutzt werden:

source: Feed API helper
de_de: Feed API Hilfe

source: Refresh feed size
de_de: Feed Größe aktualisieren

source: New virtual feed
de_de: Neuer Virtueller Feed

source: Delete feed
de_de: Feed löschen

source: Deleting a feed is permanent.
de_de: Feed wird dauerhaft gelöscht.

source: If you have Input Processlist processors that use this feed, after deleting it, review that process lists or they will be in error, freezing other Inputs. Also make sure no Dashboards use the deleted feed.
de_de: Prüfen Sie nach dem Löschen die Process Listen. Der gelöschte Feed darf nicht mehr verwendet werden, sonst entstehen Fehler und andere Inputs frieren ein. Prüfen Sie außerdem das kein Dashboard den gelöschten Feed benutzt.

source: This is a Virtual Feed, after deleting it, make sure no Dashboard continue to use the deleted feed.
de_de: Dies ist ein virtueller Feed, nach dem Löschen prüfen Sie das kein Dashboard den gelöschten Feed benutzt.

source: Are you sure you want to delete?
de_de: Diesen Feed wirklich löschen?

source: Cancel
de_de: Abbrechen

source: Delete permanently
de_de: Dauerhaft gelöscht

source: Select the time range and interval that you wish to export:
de_de: Auswahl Zeitbereich und Intervall für Export

source: Start date & time
de_de: Start Datum & Zeit

source: End date & time
de_de: Ende Datum & Zeit

source: Interval
de_de: Intervall

source: Date time format
de_de: Datums/Zeit-Format

source: Offset secs (for daily)
de_de: Offset in Sek. (für täglich)

source: Estimated download size
de_de: ca. Größe des Downloads

source: Close
de_de: Schliessen

source: Export
de_de: Exportieren

source: New Virtual Feed
de_de: Neuer Virtueller Feed

source: Feed DataType
de_de: Feed Datentyp

source: Realtime
de_de: Echtzeit

source: Daily
de_de: Täglich

source: Save
de_de: Speichern

source: Process list
de_de: Process LIste

source: Size
de_de: Größe

source: Updated
de_de: Aktualisiert

source: Public
de_de: Öffentlich

source: Datatype
de_de: Datentyp

source: Value
de_de: Wert
